
{
    "navbar.learn": "Aprender",
    "navbar.blog": "Blog",
    "navbar.language": "Idioma",
    "learn.quickstart": "Inicio rápido",
    "learn.quickstart.description": "Bienvenido a la documentación de React. Esta página te dará una introducción al 80% de los conceptos de React que utilizarás a diario.",
    "breadcrumb.page": "Página",
    "learn.quickStart": "Inicio rápido",
    "learn.welcomeMessage": "¡Bienvenido a la documentación de React! Esta página te dará una introducción al 80% de los conceptos de React que utilizarás a diario.",
    "learn.youWillLearn": "Aprenderás",
    "learn": {
      "listArr": {
        "item1": "Cómo crear y anidar componentes",
        "item2": "Cómo mostrar datos",
        "item3": "Cómo renderizar condiciones y listas",
        "item4": "Cómo responder a eventos y actualizar la pantalla",
        "item5": "Cómo compartir datos entre componentes"
      }
    },
    "learnData.Creating and nesting components": {
      "title": "Creación y anidamiento de componentes",
      "content": "Las aplicaciones de React están compuestas por componentes. Un componente es una parte de la interfaz de usuario (UI) que tiene su propia lógica y apariencia. Un componente puede ser tan pequeño como un botón o tan grande como una página completa."
    },
    "learnData.Displaying data": {
      "title": "Mostrar datos",
      "content": "JSX te permite agregar marcado en JavaScript. Las llaves en ángulo te permiten \"escapar\" de nuevo a JavaScript para que puedas incrustar alguna variable de tu código y mostrarla al usuario. Por ejemplo, esto mostrará user.name."
    },
    "learnData.Conditional rendering": {
      "title": "Renderización condicional",
      "content": "En React, no hay una sintaxis especial para escribir condiciones. En su lugar, utilizarás las mismas técnicas que utilizas al escribir código JavaScript regular. Por ejemplo, puedes usar una declaración if para incluir JSX condicionalmente."
    },
    "learnData.Updating the screen": {
      "title": "Actualización de la pantalla",
      "content": "A menudo, querrás que tu componente \"recuerde\" cierta información y la muestre. Por ejemplo, quizás desees contar cuántas veces se hace clic en un botón. Para hacerlo, agrega estado a tu componente."
    },
    "learnData.Using Hooks": {
      "title": "Uso de Hooks",
      "content": "Las funciones que comienzan con 'use' se llaman Hooks. useState es un Hook incorporado proporcionado por React. Puedes encontrar otros Hooks incorporados en la referencia de la API. También puedes escribir tus propios Hooks combinando los existentes."
    },
    "blog": {
      "title": "Blog de React",
      "intro": "Este blog es la fuente oficial de actualizaciones del equipo de React. Cualquier cosa importante, incluyendo notas de lanzamiento o avisos de deprecación, se publicará aquí primero. También puedes seguir la cuenta @reactjs en Twitter, pero no te perderás nada esencial si solo lees este blog.",
      "posts": [
        {
          "title": "React Canaries: Habilitar la implementación incremental de características fuera de Meta",
          "content": "Tradicionalmente, las nuevas características de React solo estaban disponibles en Meta primero y luego se incluían en las versiones de código abierto más tarde. Nos gustaría ofrecer a la comunidad de React la opción de adoptar nuevas características individuales tan pronto como su diseño esté cerca de ser final, similar a cómo Meta utiliza React internamente. Estamos introduciendo un nuevo canal de lanzamiento Canary oficialmente compatible. Permite a las configuraciones seleccionadas, como los marcos, desvincular la adopción de características individuales de React de la programación de lanzamiento de React.",
          "time": "3 de mayo de 2023"
        },
        {
          "title": "React Labs: Lo que hemos estado trabajando - Marzo de 2023",
          "content": "En las publicaciones de React Labs, escribimos sobre proyectos en investigación y desarrollo activos. Desde nuestra última actualización, hemos avanzado significativamente en React Server Components, Asset Loading, Optimizing Compiler, Offscreen Rendering y Transition Tracing, y nos gustaría compartir lo que hemos aprendido.",
          "time": "22 de marzo de 2023"
        },
        {
          "title": "Presentación de react.dev",
          "content": "Hoy estamos encantados de lanzar react.dev, el nuevo hogar de React y su documentación. En esta publicación, nos gustaría llevarte de paseo por el nuevo sitio.",
          "time": "16 de marzo de 2023"
        },
        {
          "title": "React Labs: Lo que hemos estado trabajando - Junio de 2022",
          "content": "React 18 llevó años en desarrollo y, con ello, valiosas lecciones para el equipo de React. Su lanzamiento fue el resultado de muchos años de investigación y exploración de diversos caminos. Algunos de esos caminos tuvieron éxito; muchos más fueron callejones sin salida que llevaron a nuevos conocimientos. Una lección que hemos aprendido es que es frustrante para la comunidad esperar nuevas características sin tener una idea de los caminos que estamos explorando...",
          "time": "15 de junio de 2022"
        },
        {
          "title": "React v18.0",
          "content": "¡React 18 ya está disponible en npm! En nuestra última publicación, compartimos instrucciones paso a paso para actualizar tu aplicación a React 18. En esta publicación, daremos una visión general de las novedades de React 18 y lo que significa para el futuro...",
          "time": "29 de marzo de 2022"
        },
        {
          "title": "Cómo actualizar a React 18",
          "content": "Como compartimos en la publicación de lanzamiento, React 18 introduce características impulsadas por nuestro nuevo motor de representación concurrente, con una estrategia de adopción gradual para las aplicaciones existentes. En esta publicación, te guiarémos a través de los pasos para actualizar a React 18...",
          "time": "8 de marzo de 2022"
        },
        {
          "title": "Resumen de React Conf 2021",
          "content": "La semana pasada organizamos nuestra 6ª React Conf. En años anteriores, hemos utilizado el escenario de React Conf para realizar anuncios que cambiaron la industria, como React Native y React Hooks. Este año, compartimos nuestra visión multiplataforma para React, comenzando con el lanzamiento de React 18 y la adopción gradual de características concurrentes...",
          "time": "17 de diciembre de 2021"
        },
        {
          "title": "Presentación de React Server Components sin tamaño de paquete",
          "content": "El 2020 fue un año largo. A medida que llega a su fin, queríamos compartir una actualización especial de vacaciones sobre nuestra investigación en torno a React Server Components sin tamaño de paquete. Para presentar React Server Components, hemos preparado una charla y una demostración. Si quieres, puedes echarles un vistazo durante las vacaciones o más adelante, cuando retome el trabajo en el nuevo año...",
          "time": "21 de diciembre de 2020"
        }
      ]
    }
  }
  